## No of Working hours in Week --- Hackathon ---- (Time Series Forecasting)

In [1]:
import pandas as pd
import numpy as np

In [2]:
data = pd.read_csv(r'train.csv')
data.head()

,age,workclass,fnlwgt,education,education-num,marital-status,occupation,relationship,race,sex,capital-gain,capital-loss,hours-per-week,native-country,income
0,52,Private,98926,HS-grad,9,Never-married,Other-service,Unmarried,White,Male,-3,0,44,United-States,<=50K
1,76,Self-emp-not-inc,132607,Bachelors,12,Married-civ-spouse,Sales,Husband,White,Male,7527,0,44,United-States,>50K
2,40,Private,243258,Bachelors,13,Married-civ-spouse,Transport-moving,Husband,Amer-Indian-Eskimo,Male,19,0,57,United-States,>50K
3,76,State-gov,181259,Bachelors,12,Married-civ-spouse,Prof-specialty,Husband,White,Male,7720,0,44,United-States,>50K
4,36,Self-emp-inc,115379,Masters,13,Divorced,Exec-managerial,Not-in-family,White,Male,12,0,58,United-States,<=50K

In [3]:
data.isnull().sum()

age               0
workclass         0
fnlwgt            0
education         0
education-num     0
marital-status    0
occupation        0
relationship      0
race              0
sex               0
capital-gain      0
capital-loss      0
hours-per-week    0
native-country    0
income            0
dtype: int64

In [4]:
print(data['marital-status'].nunique())
print(data['relationship'].nunique())

7
6

## Creating two DataFrames - Numerical and Categorical df's

In [5]:
num_data = data[['fnlwgt','education-num','capital-gain']]
cat_data = data.drop(['fnlwgt','education-num','capital-gain','capital-loss','age','marital-status','hours-per-week'],axis=1)

In [6]:
num_data.head()

   fnlwgt  education-num  capital-gain
0   98926              9            -3
1  132607             12          7527
2  243258             13            19
3  181259             12          7720
4  115379             13            12

In [7]:
cat_data.head()

,workclass,education,occupation,relationship,race,sex,native-country,income
0,Private,HS-grad,Other-service,Unmarried,White,Male,United-States,<=50K
1,Self-emp-not-inc,Bachelors,Sales,Husband,White,Male,United-States,>50K
2,Private,Bachelors,Transport-moving,Husband,Amer-Indian-Eskimo,Male,United-States,>50K
3,State-gov,Bachelors,Prof-specialty,Husband,White,Male,United-States,>50K
4,Self-emp-inc,Masters,Exec-managerial,Not-in-family,White,Male,United-States,<=50K

In [8]:
cat_data.dtypes

workclass         object
education         object
occupation        object
relationship      object
race              object
sex               object
native-country    object
income            object
dtype: object

## Feature Engineering --- Categorical Variables

In [9]:
cat_data.workclass.unique()

array([' Private', ' Self-emp-not-inc', ' State-gov', ' Self-emp-inc',
       ' Federal-gov', ' Local-gov', ' Never-worked', ' Without-pay'],
      dtype=object)

In [10]:
workclass = {' Private':'Private',' Self-emp-not-inc':'Self-employed',' State-gov':'Other gov',' Self-emp-inc':'Self-employed',
            ' Federal-gov':'Federal gov',' Local-gov':'Other gov',' Never-worked':'Not Working',' Without-pay':'Not Working'}
cat_data['workclass'] = cat_data['workclass'].map(workclass)
cat_data.head()

,workclass,education,occupation,relationship,race,sex,native-country,income
0,Private,HS-grad,Other-service,Unmarried,White,Male,United-States,<=50K
1,Self-employed,Bachelors,Sales,Husband,White,Male,United-States,>50K
2,Private,Bachelors,Transport-moving,Husband,Amer-Indian-Eskimo,Male,United-States,>50K
3,Other gov,Bachelors,Prof-specialty,Husband,White,Male,United-States,>50K
4,Self-employed,Masters,Exec-managerial,Not-in-family,White,Male,United-States,<=50K

In [11]:
cat_data.workclass.unique()

array(['Private', 'Self-employed', 'Other gov', 'Federal gov',
       'Not Working'], dtype=object)

In [12]:
data.education.unique()

array([' HS-grad', ' Bachelors', ' Masters', ' Some-college', ' 7th-8th',
       ' Doctorate', ' Prof-school', ' Assoc-voc', ' Assoc-acdm',
       ' 5th-6th', ' 11th', ' 9th', ' 1st-4th', ' 12th', ' 10th',
       ' Preschool'], dtype=object)

In [13]:
education = {' Preschool':0,' 1st-4th':0,' 5th-6th':0,' 7th-8th':0,' 9th':0,' 10th':0,' HS-grad':1,' 11th':1,' 12th':1,' Prof-school':2,
            ' Assoc-voc':3,' Assoc-acdm':3,' Some-college':4,' Bachelors':5,' Masters':6,' Doctorate':7}
cat_data['education'] = cat_data['education'].map(education)
cat_data.head()

,workclass,education,occupation,relationship,race,sex,native-country,income
0,Private,1,Other-service,Unmarried,White,Male,United-States,<=50K
1,Self-employed,5,Sales,Husband,White,Male,United-States,>50K
2,Private,5,Transport-moving,Husband,Amer-Indian-Eskimo,Male,United-States,>50K
3,Other gov,5,Prof-specialty,Husband,White,Male,United-States,>50K
4,Self-employed,6,Exec-managerial,Not-in-family,White,Male,United-States,<=50K

In [14]:
cat_data.occupation.unique()

array([' Other-service', ' Sales', ' Transport-moving', ' Prof-specialty',
       ' Exec-managerial', ' Adm-clerical', ' Handlers-cleaners',
       ' Farming-fishing', ' Craft-repair', ' Protective-serv',
       ' Machine-op-inspct', ' Tech-support', ' Priv-house-serv',
       ' Armed-Forces'], dtype=object)

In [15]:
occupation = {' Other-service':'Service',' Sales':'Sales',' Transport-moving':'Service',' Prof-specialty':'Professor',
             ' Exec-managerial':'Executive',' Adm-clerical':'Admin',' Handlers-cleaners':'Service',' Farming-fishing':'Farming-Fishing',
              ' Craft-repair':'Service',' Protective-serv':'Service',' Machine-op-inspct':'Service',' Tech-support':'Tech-support',
              ' Priv-house-serv':'Service',' Armed-Forces':'Armed-Forces'}
cat_data['occupation'] = cat_data['occupation'].map(occupation)
cat_data.occupation.unique()

array(['Service', 'Sales', 'Professor', 'Executive', 'Admin',
       'Farming-Fishing', 'Tech-support', 'Armed-Forces'], dtype=object)

In [16]:
cat_data.relationship.unique()

array([' Unmarried', ' Husband', ' Not-in-family', ' Own-child', ' Wife',
       ' Other-relative'], dtype=object)

In [17]:
relationship = {' Unmarried':'Unmarried',' Husband':'Married',' Not-in-family':'Divorced',' Own-child':'Married',' Wife':'Married',
               ' Other-relative':'Unmarried'}
cat_data['Marital-status'] = cat_data['relationship'].map(relationship)
cat_data.head()

,workclass,education,occupation,relationship,race,sex,native-country,income,Marital-status
0,Private,1,Service,Unmarried,White,Male,United-States,<=50K,Unmarried
1,Self-employed,5,Sales,Husband,White,Male,United-States,>50K,Married
2,Private,5,Service,Husband,Amer-Indian-Eskimo,Male,United-States,>50K,Married
3,Other gov,5,Professor,Husband,White,Male,United-States,>50K,Married
4,Self-employed,6,Executive,Not-in-family,White,Male,United-States,<=50K,Divorced

In [18]:
cat_data.race.unique()

array([' White', ' Amer-Indian-Eskimo', ' Asian-Pac-Islander', ' Black',
       ' Other'], dtype=object)

In [19]:
race = {' White':'White',' Black':'Black',' Amer-Indian-Eskimo':'Other',' Asian-Pac-Islander':'Other',' Other':'Other'}
cat_data['race'] = cat_data.race.map(race)
cat_data.race.unique()

array(['White', 'Other', 'Black'], dtype=object)

In [20]:
cat_data.iloc[0,5]

' Male'

In [21]:
sex = {' Male':0,' Female':1}
cat_data['sex'] = cat_data['sex'].apply(lambda x: 0 if x==' Male' else 1)

In [22]:
cat_data.head()

,workclass,education,occupation,relationship,race,sex,native-country,income,Marital-status
0,Private,1,Service,Unmarried,White,0,United-States,<=50K,Unmarried
1,Self-employed,5,Sales,Husband,White,0,United-States,>50K,Married
2,Private,5,Service,Husband,Other,0,United-States,>50K,Married
3,Other gov,5,Professor,Husband,White,0,United-States,>50K,Married
4,Self-employed,6,Executive,Not-in-family,White,0,United-States,<=50K,Divorced

In [23]:
cat_data.sex.unique()

array([0, 1], dtype=int64)

In [24]:
cat_data.drop(['native-country','relationship'],axis=1,inplace=True)

In [25]:
cat_data['income'] = cat_data['income'].apply(lambda x: 1 if x.strip()[0] == '>' else 0)

In [26]:
cat_data.head()

       workclass  education occupation   race  sex  income Marital-status
0        Private          1    Service  White    0       0      Unmarried
1  Self-employed          5      Sales  White    0       1        Married
2        Private          5    Service  Other    0       1        Married
3      Other gov          5  Professor  White    0       1        Married
4  Self-employed          6  Executive  White    0       0       Divorced

### One hot Encoding

In [27]:
workclass_df = pd.get_dummies(cat_data['workclass'])
workclass_df.head()

   Federal gov  Not Working  Other gov  Private  Self-employed
0            0            0          0        1              0
1            0            0          0        0              1
2            0            0          0        1              0
3            0            0          1        0              0
4            0            0          0        0              1

In [28]:
occupation_df = pd.get_dummies(cat_data['occupation'])
occupation_df.head()

,Admin,Armed-Forces,Executive,Farming-Fishing,Professor,Sales,Service,Tech-support
0,0,0,0,0,0,0,1,0
1,0,0,0,0,0,1,0,0
2,0,0,0,0,0,0,1,0
3,0,0,0,0,1,0,0,0
4,0,0,1,0,0,0,0,0

In [29]:
race_df = pd.get_dummies(cat_data['race'])
marital_df = pd.get_dummies(cat_data['Marital-status'])

In [30]:
num_data.head()

   fnlwgt  education-num  capital-gain
0   98926              9            -3
1  132607             12          7527
2  243258             13            19
3  181259             12          7720
4  115379             13            12

In [31]:
num_data['capital-gain'].dtype

dtype('int64')

In [32]:
num_data['capital-gain'] = num_data['capital-gain'].apply(lambda x: 0 if x==0 or x<0 else 1)

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

## Feature Engineering - Numeical Data

In [33]:
num_data.head()

   fnlwgt  education-num  capital-gain
0   98926              9             0
1  132607             12             1
2  243258             13             1
3  181259             12             1
4  115379             13             1

### Final DataSet

In [34]:
final_df = pd.concat([data['age'],num_data['capital-gain'],cat_data[['education','sex','income']],workclass_df,occupation_df,race_df],axis=1)

In [35]:
final_df

,age,capital-gain,education,sex,income,Federal gov,Not Working,Other gov,Private,Self-employed,...,Armed-Forces,Executive,Farming-Fishing,Professor,Sales,Service,Tech-support,Black,Other,White
0,52,0,1,0,0,0,0,0,1,0,...,0,0,0,0,0,1,0,0,0,1
1,76,1,5,0,1,0,0,0,0,1,...,0,0,0,0,1,0,0,0,0,1
2,40,1,5,0,1,0,0,0,1,0,...,0,0,0,0,0,1,0,0,1,0
3,76,1,5,0,1,0,0,1,0,0,...,0,0,0,1,0,0,0,0,0,1
4,36,1,6,0,0,0,0,0,0,1,...,0,1,0,0,0,0,0,0,0,1
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
18939,25,1,5,1,0,0,0,0,1,0,...,0,0,0,0,0,1,0,0,0,1
18940,22,1,4,1,0,0,0,0,1,0,...,0,0,0,0,0,1,0,0,0,1
18941,47,1,5,1,0,0,0,1,0,0,...,0,0,0,0,0,0,0,1,0,0
18942,48,0,5,0,0,0,0,0,1,0,...,0,0,0,0,1,0,0,0,1,0
18943,47,0,6,0,1,1,0,0,0,0,...,0,0,0,0,0,1,0,0,0,1

In [36]:
final_df = pd.concat([final_df,marital_df],axis=1)

In [37]:
final_df.head()

,age,capital-gain,education,sex,income,Federal gov,Not Working,Other gov,Private,Self-employed,...,Professor,Sales,Service,Tech-support,Black,Other,White,Divorced,Married,Unmarried
0,52,0,1,0,0,0,0,0,1,0,...,0,0,1,0,0,0,1,0,0,1
1,76,1,5,0,1,0,0,0,0,1,...,0,1,0,0,0,0,1,0,1,0
2,40,1,5,0,1,0,0,0,1,0,...,0,0,1,0,0,1,0,0,1,0
3,76,1,5,0,1,0,0,1,0,0,...,1,0,0,0,0,0,1,0,1,0
4,36,1,6,0,0,0,0,0,0,1,...,0,0,0,0,0,0,1,1,0,0

In [38]:
final_df['WorkingHours'] = data['hours-per-week']

In [39]:
final_df.columns

Index(['age', 'capital-gain', 'education', 'sex', 'income', 'Federal gov',
       'Not Working', 'Other gov', 'Private', 'Self-employed', 'Admin',
       'Armed-Forces', 'Executive', 'Farming-Fishing', 'Professor', 'Sales',
       'Service', 'Tech-support', 'Black', 'Other', 'White', 'Divorced',
       'Married', 'Unmarried', 'WorkingHours'],
      dtype='object')

## Testing Data Preprocessing

In [40]:
test = pd.read_csv(r'test.csv')
test.head()

,age,workclass,fnlwgt,education,education-num,marital-status,occupation,relationship,race,sex,capital-gain,capital-loss,native-country,income,hours-per-week
0,40,Without-pay,106899,HS-grad,8,Never-married,Adm-clerical,Own-child,White,Male,0,0,United-States,<=50K,NaN
1,38,Private,157191,HS-grad,8,Married-civ-spouse,Craft-repair,Husband,Black,Male,0,0,United-States,<=50K,NaN
2,76,Self-emp-not-inc,102547,Some-college,10,Widowed,Sales,Not-in-family,Asian-Pac-Islander,Female,32,0,United-States,<=50K,NaN
3,38,Self-emp-not-inc,44426,HS-grad,9,Never-married,Sales,Unmarried,White,Male,30,0,United-States,>50K,NaN
4,62,Without-pay,33230,HS-grad,9,Married-civ-spouse,Sales,Husband,White,Male,-4,0,United-States,<=50K,NaN

In [41]:
test.drop(['fnlwgt','education-num','marital-status','capital-loss','hours-per-week'],axis=1,inplace=True)

In [42]:
test.drop('native-country',axis=1,inplace=True)

In [43]:
test.head()

,age,workclass,education,occupation,relationship,race,sex,capital-gain,income
0,40,Without-pay,HS-grad,Adm-clerical,Own-child,White,Male,0,<=50K
1,38,Private,HS-grad,Craft-repair,Husband,Black,Male,0,<=50K
2,76,Self-emp-not-inc,Some-college,Sales,Not-in-family,Asian-Pac-Islander,Female,32,<=50K
3,38,Self-emp-not-inc,HS-grad,Sales,Unmarried,White,Male,30,>50K
4,62,Without-pay,HS-grad,Sales,Husband,White,Male,-4,<=50K

In [44]:
print(test.workclass.unique(),test.education.unique(),test.occupation.unique(),test.relationship.unique(),test.race.unique())

[' Without-pay' ' Private' ' Self-emp-not-inc' ' Federal-gov'
 ' Self-emp-inc' ' State-gov' ' Local-gov' ' Never-worked'] [' HS-grad' ' Some-college' ' Bachelors' ' Assoc-voc' ' Doctorate'
 ' 5th-6th' ' 11th' ' Masters' ' 9th' ' 7th-8th' ' 10th' ' Assoc-acdm'
 ' 1st-4th' ' Prof-school' ' 12th' ' Preschool'] [' Adm-clerical' ' Craft-repair' ' Sales' ' Prof-specialty'
 ' Exec-managerial' ' Farming-fishing' ' Other-service'
 ' Handlers-cleaners' ' Machine-op-inspct' ' Transport-moving'
 ' Tech-support' ' Priv-house-serv' ' Protective-serv' ' Armed-Forces'] [' Own-child' ' Husband' ' Not-in-family' ' Unmarried' ' Wife'
 ' Other-relative'] [' White' ' Black' ' Asian-Pac-Islander' ' Other' ' Amer-Indian-Eskimo']

### Applying all Feature Engineering techniques on Test Data

In [45]:
test['workclass'] = test['workclass'].map(workclass)
test['education'] = test['education'].map(education)
test['occupation'] = test['occupation'].map(occupation)
test['relationship'] = test['relationship'].map(relationship)
test['race'] = test['race'].map(race)
test['sex'] = test['sex'].apply(lambda x: 0 if x== ' Male' else 1)
test['income'] = test['income'].apply(lambda x: 0 if x.strip()[0] == '>' else 1)
test['capital-gain'] = test['capital-gain'].apply(lambda x: 0 if x==0 or x<0 else 1)

In [46]:
test.head()

,age,workclass,education,occupation,relationship,race,sex,capital-gain,income
0,40,Not Working,1,Admin,Married,White,0,0,1
1,38,Private,1,Service,Married,Black,0,0,1
2,76,Self-employed,4,Sales,Divorced,Other,1,1,1
3,38,Self-employed,1,Sales,Unmarried,White,0,1,0
4,62,Not Working,1,Sales,Married,White,0,0,1

In [47]:
wc_df = pd.get_dummies(test['workclass'])
oc_df = pd.get_dummies(test['occupation'])
r_df = pd.get_dummies(test['relationship'])
r_df = pd.get_dummies(test['race'])

In [48]:
rl_df = pd.get_dummies(test['relationship'])

In [49]:
final_test = pd.concat([test['age'],test['capital-gain'],test[['education','sex','income']],wc_df,oc_df,r_df,rl_df],axis=1)

In [50]:
final_test.columns

Index(['age', 'capital-gain', 'education', 'sex', 'income', 'Federal gov',
       'Not Working', 'Other gov', 'Private', 'Self-employed', 'Admin',
       'Armed-Forces', 'Executive', 'Farming-Fishing', 'Professor', 'Sales',
       'Service', 'Tech-support', 'Black', 'Other', 'White', 'Divorced',
       'Married', 'Unmarried'],
      dtype='object')

In [51]:
final_df.columns

Index(['age', 'capital-gain', 'education', 'sex', 'income', 'Federal gov',
       'Not Working', 'Other gov', 'Private', 'Self-employed', 'Admin',
       'Armed-Forces', 'Executive', 'Farming-Fishing', 'Professor', 'Sales',
       'Service', 'Tech-support', 'Black', 'Other', 'White', 'Divorced',
       'Married', 'Unmarried', 'WorkingHours'],
      dtype='object')

## ML Model Creation

In [52]:
from sklearn.ensemble import RandomForestRegressor
from sklearn.linear_model import LinearRegression

In [53]:
rf = RandomForestRegressor()
lr = LinearRegression()

In [54]:
X = final_df.drop('WorkingHours',axis=1)
Y = final_df['WorkingHours']

In [55]:
from sklearn.model_selection import train_test_split
from sklearn.metrics import r2_score
xtrain,xtest,ytrain,ytest = train_test_split(X,Y,test_size=0.2,random_state=1)

## Random Forest Regressor

In [56]:
rf.fit(xtrain,ytrain)
ypred = rf.predict(xtest)
ytrain_p = rf.predict(xtrain)
print(r2_score(ytrain,ytrain_p))
print(r2_score(ytest,ypred))

0.7554580625744323
0.07932011827181085

In [57]:
rf.fit(X,Y)
final_rf_pred = rf.predict(final_test)   ##On testing data

## Linear Regression

In [58]:
lr.fit(xtrain,ytrain)
lr_train_pred = lr.predict(xtrain)
lr_test_pred = lr.predict(xtest)
print(r2_score(ytrain,lr_train_pred),r2_score(ytest,lr_test_pred))

0.19258661586555426 0.20899191233637326

In [59]:
lr.fit(X,Y)
final_lr_pred = lr.predict(final_test)

In [60]:
final_lr_pred[:5]

array([41.45693202, 39.15278835, 47.47180218, 44.43494208, 44.17570623])

## Hyper Parameter Tuning

In [61]:
from sklearn.model_selection import GridSearchCV

In [62]:
rf_params = {'n_estimators':[10,30,50,100,150], 'max_depth':[2,3,5,7]}

In [63]:
cv = GridSearchCV(RandomForestRegressor(),rf_params,cv=5)

In [64]:
cv.fit(xtrain,ytrain)

GridSearchCV(cv=5, estimator=RandomForestRegressor(),
             param_grid={'max_depth': [2, 3, 5, 7],
                         'n_estimators': [10, 30, 50, 100, 150]})

In [65]:
cv.best_params_

{'max_depth': 7, 'n_estimators': 150}

In [66]:
rf_model = cv.best_estimator_

In [67]:
ypred_cv = rf_model.predict(xtest)
ytrain_cv = rf_model.predict(xtrain)
print(r2_score(ytrain,ytrain_cv))
print(r2_score(ytest,ypred_cv))

0.26850606936951027
0.23062164250599726

In [70]:
final_rf_cv = rf_model.predict(final_test)

In [71]:
predictions1 = pd.DataFrame(final_rf_cv,columns=['hours-per-week'],dtype='int64')
predictions1.head()

   hours-per-week
0              42
1              41
2              32
3              46
4              44

In [73]:
import csv
predictions1.to_csv(r'C:\Users\T lohith kumar\Desktop\NoOfHrsPerWeek\rf_CV.csv')

## Converting into CSV file

In [74]:
predictions = pd.DataFrame(final_lr_pred,columns=['hours-per-week'],dtype='int64')

In [75]:
predictions.head()

   hours-per-week
0              41
1              39
2              47
3              44
4              44

In [76]:
import csv

In [77]:
predictions.to_csv(r'C:\Users\T lohith kumar\Desktop\NoOfHrsPerWeek\submission1.csv')

In [78]:
prediction_rf = pd.DataFrame(final_rf_pred,columns=['hours-per-week'],dtype='int64')
prediction_rf.head()

   hours-per-week
0              41
1              43
2              26
3              47
4              42

In [80]:
prediction_rf.to_csv(r'C:\Users\T lohith kumar\Desktop\NoOfHrsPerWeek\submission_rf.csv')